<a href="https://colab.research.google.com/github/sudip-khanal/python-Basics/blob/main/merge_join_on_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import pandas as pd

data1={
    "Emp Id":["E01","E02","E03","E04","E05","E06","E07","E08","E09"],
    "Names":["Ram","Shyam","Hari","Sita","Gita","Rina","Abin","Abina","Sabina"],
    "Age":[30,30,20,34,66,54,43,65,34]
}

data2={
    "Emp Id":["E01","E02","E03","E04","E05","E06","E07","E20","E30"],
    "Salary":[3000,30000,20000,34334,66800,54323,43000,5800,67000]
}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

print(df1)
print()
print(df2)

  Emp Id   Names  Age
0    E01     Ram   30
1    E02   Shyam   30
2    E03    Hari   20
3    E04    Sita   34
4    E05    Gita   66
5    E06    Rina   54
6    E07    Abin   43
7    E08   Abina   65
8    E09  Sabina   34

  Emp Id  Salary
0    E01    3000
1    E02   30000
2    E03   20000
3    E04   34334
4    E05   66800
5    E06   54323
6    E07   43000
7    E20    5800
8    E30   67000

merging on the basis of emp id

In [10]:
import pandas as pd

print(pd.merge(df1,df2,on="Emp Id",how= "inner" ))

  Emp Id  Names  Age  Salary
0    E01    Ram   30    3000
1    E02  Shyam   30   30000
2    E03   Hari   20   20000
3    E04   Sita   34   34334
4    E05   Gita   66   66800
5    E06   Rina   54   54323
6    E07   Abin   43   43000

joins are same as sql joins left join right join inner join outer join

In [11]:
print(pd.merge(df1,df2,on="Emp Id",how= "left" ))

  Emp Id   Names  Age   Salary
0    E01     Ram   30   3000.0
1    E02   Shyam   30  30000.0
2    E03    Hari   20  20000.0
3    E04    Sita   34  34334.0
4    E05    Gita   66  66800.0
5    E06    Rina   54  54323.0
6    E07    Abin   43  43000.0
7    E08   Abina   65      NaN
8    E09  Sabina   34      NaN

In [15]:
print(pd.merge(left=df1,right=df2,on="Emp Id",how= "right" ))

  Emp Id  Names   Age  Salary
0    E01    Ram  30.0    3000
1    E02  Shyam  30.0   30000
2    E03   Hari  20.0   20000
3    E04   Sita  34.0   34334
4    E05   Gita  66.0   66800
5    E06   Rina  54.0   54323
6    E07   Abin  43.0   43000
7    E20    NaN   NaN    5800
8    E30    NaN   NaN   67000

In [19]:
import pandas as pd

data1={
    "Emp Id":["E01","E02","E03","E04","E05","E06","E07","E08","E09"],
    "Names":["Ram","Shyam","Hari","Sita","Gita","Rina","Abin","Abina","Sabina"],
    "Age":[30,30,20,34,66,54,43,65,34]
}

data2={
    "Emp Id":["E11","E12","E13","E14","E15","E16","E17","E18","E19"],
    "Names":["Krishna","Roshan","Ashik","Prabin","Jiban","Asmita","Sunil","Sanju","Pratikshya"],
    "Age":[19,20,24,23,26,21,24,23,22]
}
dataf1=pd.DataFrame(data1)
dataf2=pd.DataFrame(data2)

print(dataf1)
print()
print(dataf2)

  Emp Id   Names  Age
0    E01     Ram   30
1    E02   Shyam   30
2    E03    Hari   20
3    E04    Sita   34
4    E05    Gita   66
5    E06    Rina   54
6    E07    Abin   43
7    E08   Abina   65
8    E09  Sabina   34

  Emp Id       Names  Age
0    E11     Krishna   19
1    E12      Roshan   20
2    E13       Ashik   24
3    E14      Prabin   23
4    E15       Jiban   26
5    E16      Asmita   21
6    E17       Sunil   24
7    E18       Sanju   23
8    E19  Pratikshya   22

concatination

In [21]:
print(pd.concat([dataf1,dataf2]))

  Emp Id       Names  Age
0    E01         Ram   30
1    E02       Shyam   30
2    E03        Hari   20
3    E04        Sita   34
4    E05        Gita   66
5    E06        Rina   54
6    E07        Abin   43
7    E08       Abina   65
8    E09      Sabina   34
0    E11     Krishna   19
1    E12      Roshan   20
2    E13       Ashik   24
3    E14      Prabin   23
4    E15       Jiban   26
5    E16      Asmita   21
6    E17       Sunil   24
7    E18       Sanju   23
8    E19  Pratikshya   22

compare DataFrames

In [25]:
import pandas as pd

d1={
    "Fruits":["Apple","Banana","Mango","Papaya","Guava","Greaps"],
    "Quentity":["20","10","5","7","5","88"],
    "Price":[30,30,20,34,66,54,]
}
data1=pd.DataFrame(d1)
print(data1)
print("\n")

d2={
    "Fruits":["Apple","Banana","Mango","Papaya","Guava","Greaps"],
    "Quentity":["20","20","50","70","5","88"],
    "Price":[100,20,200,35,66,45,]
}

data2=pd.DataFrame(d2)
print(data2)

   Fruits Quentity  Price
0   Apple       20     30
1  Banana       10     30
2   Mango        5     20
3  Papaya        7     34
4   Guava        5     66
5  Greaps       88     54


   Fruits Quentity  Price
0   Apple       20    100
1  Banana       20     20
2   Mango       50    200
3  Papaya       70     35
4   Guava        5     66
5  Greaps       88     45

In [28]:
print(data1.compare(data2,align_axis=0))

        Quentity  Price
0 self       NaN   30.0
  other      NaN  100.0
1 self        10   30.0
  other       20   20.0
2 self         5   20.0
  other       50  200.0
3 self         7   34.0
  other       70   35.0
5 self       NaN   54.0
  other      NaN   45.0

In [30]:
print(data1.compare(data2,keep_equal=True,align_axis=0))

        Quentity  Price
0 self        20     30
  other       20    100
1 self        10     30
  other       20     20
2 self         5     20
  other       50    200
3 self         7     34
  other       70     35
5 self        88     54
  other       88     45

In [32]:
print(data1.compare(data2,keep_shape=True))

  Fruits       Quentity       Price
    self other     self other  self  other
0    NaN   NaN      NaN   NaN  30.0  100.0
1    NaN   NaN       10    20  30.0   20.0
2    NaN   NaN        5    50  20.0  200.0
3    NaN   NaN        7    70  34.0   35.0
4    NaN   NaN      NaN   NaN   NaN    NaN
5    NaN   NaN      NaN   NaN  54.0   45.0

In [33]:
print(data1.compare(data2,keep_shape=False))

  Quentity       Price
      self other  self  other
0      NaN   NaN  30.0  100.0
1       10    20  30.0   20.0
2        5    50  20.0  200.0
3        7    70  34.0   35.0
5      NaN   NaN  54.0   45.0

Pivoting and Melting

In [34]:
import pandas as pd

d1={
    "Roll":["R1","R2","R1","R2"],
    "Name":["John","Mary","Alex","Peter"],
    "Houses":["Red","Green","yello","Red"]
}
data1=pd.DataFrame(d1)
print(data1)
print("\n")

  Roll   Name Houses
0   R1   John    Red
1   R2   Mary  Green
2   R1   Alex  yello
3   R2  Peter    Red

In [36]:
print(data1.pivot(index="Roll",columns="Name",values="Houses"))

Name   Alex John   Mary Peter
Roll
R1    yello  Red    NaN   NaN
R2      NaN  NaN  Green   Red

Melting

In [44]:

print("\n")
print(pd.melt(data1,id_vars=["Name"],value_vars=["Houses"]))

    Name variable  value
0   John   Houses    Red
1   Mary   Houses  Green
2   Alex   Houses  yello
3  Peter   Houses    Red